Revit 2026 API

# BuiltInFailuresEnergyAnalysisUtilitiesDBFailures Class

---

Failures about EnergyAnalysisUtilitiesDBFailures.

SystemObject Autodesk.Revit.DBBuiltInFailuresEnergyAnalysisUtilitiesDBFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class EnergyAnalysisUtilitiesDBFailures
```
```vb
Public NotInheritable Class EnergyAnalysisUtilitiesDBFailures
```
```cpp
public ref class EnergyAnalysisUtilitiesDBFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type EnergyAnalysisUtilitiesDBFailures = class end
```

The BuiltInFailuresEnergyAnalysisUtilitiesDBFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AimErrEmptyName | MassZone '%1' has empty name and id values which cannot be used as gbXML identifiers. |

#### Reference

Autodesk.Revit.DB Namespace